tdxguiping/ESP32_S3_epaper/main/ch583_uart/ch583_wifi_uart_protocol.c
// EPD_Vcc:PA.6  // if 1 then open ,if 0 then 0
// VBAT_Vcc:PB.3 // if 1 then open ,if 0 then 0


#include "ch583_wifi_uart_protocol.h"
#include "debug_output.h"
#include "epd_display_mode.h"
#include "epd_sd_power_test.h"
#include "epd_type.h"
#include "factory_reset.h"
#include "ch583_factory_test.h"
#include "led_status.h"
#include "local_image_browsing.h"
#include "server_network_sta_time.h"
#include "server_network_sta_wifi_work_time.h"
#include "tdx_cfg.h"

#include <stdbool.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <esp_app_desc.h>
#include <freertos/FreeRTOS.h>
#include <freertos/semphr.h>
#include <freertos/task.h>
#include <driver/uart.h>
#include <nvs.h>

#define CH583_WIFI_MAX_ARG_LEN 300
#define CH583_WIFI_MAX_WIFI_DATA_LEN 256
#define CH583_WIFI_MAX_FRAME_BODY_LEN 448
#define CH583_WIFI_MAX_BLE_MESSAGE_LEN 2048

static const char *TAG = "ch583_proto";

#ifndef CH583_WIFI_UART_PORT
// Use the board-level CH583 UART port so protocol TX follows the C5 UART1 wiring.
// 使用板级 CH583 串口号，保证协议发送跟随 C5 的 UART1 接线。
#define CH583_WIFI_UART_PORT USER_CH583_UART_PORT
#endif

#ifndef CH583_WIFI_UART_DEBUG_PRINT_ENABLE
#define CH583_WIFI_UART_DEBUG_PRINT_ENABLE 0
#endif

#ifndef CH583_WIFI_UART_DIRECTION_PRINT_ENABLE
#define CH583_WIFI_UART_DIRECTION_PRINT_ENABLE 0
#endif

#ifndef CH583_WIFI_UART_TX_SILENCE_MS
#define CH583_WIFI_UART_TX_SILENCE_MS 100
#endif

#ifndef CH583_WIFI_UART_BAD_CRC_RETRY_MAX
#define CH583_WIFI_UART_BAD_CRC_RETRY_MAX 10
#endif

#define CH583_WIFI_TX_PENDING_MAX 8

#if CH583_WIFI_UART_DEBUG_PRINT_ENABLE
#define CH583_WIFI_DEBUG_PRINTF(...) UserDebugOutput_Printf(__VA_ARGS__)
#else
#define CH583_WIFI_DEBUG_PRINTF(...) do { } while (0)
#endif

#if CH583_WIFI_UART_DIRECTION_PRINT_ENABLE
#define CH583_WIFI_DIRECTION_PRINTF(...) UserDebugOutput_Printf(__VA_ARGS__)
#else
#define CH583_WIFI_DIRECTION_PRINTF(...) do { } while (0)
#endif

typedef struct {
    uint16_t seq;
    char cmd[16];
    size_t arg_len;
    uint16_t part;
    uint16_t total;
    const char *arg;
} ch583_wifi_frame_t;

typedef struct {
    char mac[CH583_DEVICE_INFO_MAC_HEX_LEN + 1];
    uint8_t ble_ver;
    char screen_type;
    uint8_t board_info;
    uint8_t epd_type;
    ch583_wake_reason_t wake_reason;
} ch583_wifi_device_info_t;

typedef enum {
    CH583_DEVICE_INFO_PARSE_OK = 0,
    CH583_DEVICE_INFO_PARSE_BAD_ARG,
    CH583_DEVICE_INFO_PARSE_UNSUPPORTED_EPD,
} ch583_wifi_device_info_parse_result_t;

typedef enum {
    CH583_KEY_SOURCE_DEVICE_INFO = 0,
    CH583_KEY_SOURCE_KEY_EVENT,
} ch583_key_source_t;

typedef enum {
    CH583_KEY_PB1 = 1,
    CH583_KEY_PB2 = 2,
} ch583_key_id_t;

// Keep the TX sequence independent because each sender owns its own SEQ counter.
static uint16_t s_tx_seq;
static SemaphoreHandle_t s_tx_mutex;

typedef struct {
    bool valid;
    uint16_t seq;
    uint8_t bad_crc_retry_count;
    uint32_t order;
    size_t frame_len;
    char frame[CH583_WIFI_MAX_FRAME_BODY_LEN + 24];
} ch583_wifi_pending_tx_t;

static ch583_wifi_pending_tx_t s_pending_tx[CH583_WIFI_TX_PENDING_MAX];
static uint32_t s_pending_tx_order;

// Cache partial UART bytes so split frames can still be parsed.
static bool s_in_frame;
static bool s_wait_frame_start_hash;
static char s_frame_body[CH583_WIFI_MAX_FRAME_BODY_LEN + 1];
static size_t s_frame_body_len;
static bool s_rx_seq_seen;
static uint16_t s_last_rx_seq;

// Keep only one BLE_DATA split message because V1 does not allow interleaved transfers.
static bool s_ble_join_active;
static uint16_t s_ble_expected_part;
static uint16_t s_ble_total;
static size_t s_ble_len;
static char s_ble_buf[CH583_WIFI_MAX_BLE_MESSAGE_LEN + 1];
static bool s_ble_activity_active;
static char s_ble_mac[CH583_DEVICE_INFO_MAC_HEX_LEN + 1];
static uint8_t s_ble_ver;
static bool s_device_info_loaded;
static bool s_ble_ver_nvs_valid;
// Track the required startup handshake and suppress repeated wake actions.
static bool s_device_info_received;
static bool s_key_event_seq_seen;
static uint16_t s_last_key_event_seq;
static uint8_t s_wifi_provision_status;
static bool s_wifi_provision_status_valid;

static bool ch583_wifi_is_upper_hex_string(const char *text, size_t len);

static int ch583_wifi_base64url_encode(const uint8_t *in, size_t in_len, char *out, size_t out_size)
{
    static const char table[] = "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789-_";
    size_t out_len = 0;

    if (in == NULL || out == NULL || out_size == 0) {
        return -1;
    }

    for (size_t i = 0; i < in_len; i += 3) {
        uint32_t value = ((uint32_t)in[i]) << 16;
        size_t remain = in_len - i;
        if (remain > 1) {
            value |= ((uint32_t)in[i + 1]) << 8;
        }
        if (remain > 2) {
            value |= in[i + 2];
        }

        size_t emit = remain >= 3 ? 4 : remain + 1;
        for (size_t j = 0; j < emit; j++) {
            if (out_len + 1 >= out_size) {
                return -1;
            }
            out[out_len++] = table[(value >> (18 - (6 * j))) & 0x3FU];
        }
    }

    out[out_len] = '\0';
    return (int)out_len;
}

uint16_t ch583_wifi_uart_crc16(const void *data, size_t len)
{
    const uint8_t *bytes = (const uint8_t *)data;
    uint16_t crc = 0xFFFF;

    for (size_t i = 0; i < len; i++) {
        crc ^= (uint16_t)(bytes[i] << 8);
        for (int bit = 0; bit < 8; bit++) {
            if ((crc & 0x8000) != 0) {
                crc = (uint16_t)((crc << 1) ^ 0x1021);
            } else {
                crc <<= 1;
            }
        }
    }

    return crc;
}

static void ch583_wifi_load_device_info_from_nvs(void)
{
    char saved_mac[CH583_DEVICE_INFO_MAC_HEX_LEN + 1] = {0};
    esp_err_t mac_ret;
    esp_err_t ver_ret;

    if (s_device_info_loaded) {
        return;
    }
    s_device_info_loaded = true;

    mac_ret = app_nvs_read_str(CH583_DEVICE_INFO_MAC_NVS_KEY,
                               saved_mac,
                               sizeof(saved_mac),
                               "");
    if (mac_ret != ESP_OK && mac_ret != ESP_ERR_NVS_NOT_FOUND) {
        ESP_LOGE(TAG, "DEVICE_INFO MAC load failed ret=%s", esp_err_to_name(mac_ret));
    } else if (strlen(saved_mac) == CH583_DEVICE_INFO_MAC_HEX_LEN &&
               ch583_wifi_is_upper_hex_string(saved_mac, CH583_DEVICE_INFO_MAC_HEX_LEN)) {
        memcpy(s_ble_mac, saved_mac, CH583_DEVICE_INFO_MAC_HEX_LEN + 1);
    }

    ver_ret = app_nvs_read_u8(CH583_DEVICE_INFO_BLE_VER_NVS_KEY,
                              &s_ble_ver,
                              CH583_DEVICE_INFO_BLE_VER_DEFAULT);
    s_ble_ver_nvs_valid = ver_ret == ESP_OK;
    if (ver_ret != ESP_OK) {
        ESP_LOGE(TAG, "DEVICE_INFO BLE version load failed ret=%s",
                 esp_err_to_name(ver_ret));
    }

    ESP_LOGI(TAG, "DEVICE_INFO data loaded MAC=%s BLE version=%u",
             s_ble_mac[0] != '\0' ? s_ble_mac : "(empty)",
             (unsigned int)s_ble_ver);
}

int ch583_wifi_uart_protocol_init(void)
{
    if (s_tx_mutex == NULL) {
        s_tx_mutex = xSemaphoreCreateMutex();
    }
    ch583_wifi_load_device_info_from_nvs();
    return s_tx_mutex != NULL ? 0 : -1;
}

