tdxguiping/ESP32_S3_epaper/main/ch583_uart/ch583_wifi_uart_protocol.c
static int ch583_wifi_write_frame_text(const char *frame_text, size_t frame_len)
{
    int ret = -1;

    if (frame_text == NULL || frame_len == 0) {
        return -1;
    }

    // vTaskDelay(pdMS_TO_TICKS(CH583_WIFI_UART_TX_SILENCE_MS));

    // Write one complete protocol frame through the UART driver so console logs are less likely to split it.
    ret = uart_write_bytes(CH583_WIFI_UART_PORT, frame_text, frame_len);

    // Wait until the frame leaves the UART TX FIFO before allowing later debug text to print.
    uart_wait_tx_done(CH583_WIFI_UART_PORT, pdMS_TO_TICKS(100));
    // vTaskDelay(pdMS_TO_TICKS(CH583_WIFI_UART_TX_SILENCE_MS));

    return ret == (int)frame_len ? 0 : -1;
}

static bool ch583_wifi_cmd_expects_reply(const char *cmd)
{
    return cmd != NULL &&
           strcmp(cmd, "ACK") != 0 &&
           strcmp(cmd, "ERR") != 0 &&
           strcmp(cmd, "PONG") != 0 &&
           strcmp(cmd, "POWER_OFF") != 0 &&
           strcmp(cmd, "TIME_GET") != 0 &&
           strcmp(cmd, "TIME_STATUS") != 0 &&
           strcmp(cmd, "NFC_STATUS") != 0;
}

static ch583_wifi_pending_tx_t *ch583_wifi_find_pending_tx_locked(uint16_t seq)
{
    for (size_t i = 0; i < CH583_WIFI_TX_PENDING_MAX; i++) {
        if (s_pending_tx[i].valid && s_pending_tx[i].seq == seq) {
            return &s_pending_tx[i];
        }
    }
    return NULL;
}

static ch583_wifi_pending_tx_t *ch583_wifi_alloc_pending_tx_locked(void)
{
    ch583_wifi_pending_tx_t *oldest = &s_pending_tx[0];
    for (size_t i = 0; i < CH583_WIFI_TX_PENDING_MAX; i++) {
        if (!s_pending_tx[i].valid) {
            return &s_pending_tx[i];
        }
        if (s_pending_tx[i].order < oldest->order) {
            oldest = &s_pending_tx[i];
        }
    }
    UserDebugOutput_Printf("CH583_PROTO pending evict seq=%u\r\n", (unsigned int)oldest->seq);
    return oldest;
}

static int ch583_wifi_retry_pending_frame_locked(ch583_wifi_pending_tx_t *pending)
{
    if (pending == NULL || !pending->valid || pending->frame_len == 0) {
        return -1;
    }

    if (pending->bad_crc_retry_count >= CH583_WIFI_UART_BAD_CRC_RETRY_MAX) {
        UserDebugOutput_Printf("CH583_PROTO retry stop seq=%u count=%u\r\n",
               (unsigned int)pending->seq,
               (unsigned int)pending->bad_crc_retry_count);
        pending->valid = false;
        return -1;
    }

    pending->bad_crc_retry_count++;
    UserDebugOutput_Printf("CH583_PROTO retry BAD_CRC seq=%u count=%u\r\n",
           (unsigned int)pending->seq,
           (unsigned int)pending->bad_crc_retry_count);
    return ch583_wifi_write_frame_text(pending->frame, pending->frame_len);
}

static int ch583_wifi_send_frame(const char *cmd, const char *arg, uint8_t need_printf)
{
    char body[CH583_WIFI_MAX_FRAME_BODY_LEN + 1];
    char frame_text[CH583_WIFI_MAX_FRAME_BODY_LEN + 24];
    size_t arg_len = (arg != NULL) ? strlen(arg) : 0;
    int ret = -1;

    if (cmd == NULL || arg_len > CH583_WIFI_MAX_ARG_LEN) {
        UserDebugOutput_Printf("CH583_PROTO tx reject cmd=%s arg_len=%u\r\n",
               cmd ? cmd : "NULL", (unsigned int)arg_len);
        return -1;
    }
    if (s_tx_mutex == NULL || xSemaphoreTake(s_tx_mutex, pdMS_TO_TICKS(200)) != pdTRUE) {
        UserDebugOutput_Printf("CH583_PROTO tx mutex unavailable/timeout\r\n");
        return -1;
    }

    uint16_t current_seq = s_tx_seq;
    int body_len = snprintf(body,
                            sizeof(body),
                            "V1|SEQ=%u|CMD=%s|LEN=%u|PART=1|TOTAL=1|ARG=%s",
                            (unsigned int)current_seq,
                            cmd,
                            (unsigned int)arg_len,
                            arg ? arg : "");
    if (body_len <= 0 || body_len >= (int)sizeof(body)) {
        UserDebugOutput_Printf("CH583_PROTO tx body overflow cmd=%s\r\n", cmd);
        goto done;
    }

    uint16_t crc = ch583_wifi_uart_crc16(body, (size_t)body_len);
    int frame_len = snprintf(frame_text, sizeof(frame_text), "@#%s|CRC=%04X^&\n\r", body, crc);
    if (frame_len <= 0 || frame_len >= (int)sizeof(frame_text)) {
        UserDebugOutput_Printf("CH583_PROTO tx frame overflow cmd=%s\r\n", cmd);
        goto done;
    }

    ch583_wifi_pending_tx_t *pending = NULL;
    if (ch583_wifi_cmd_expects_reply(cmd)) {
        pending = ch583_wifi_alloc_pending_tx_locked();
        *pending = (ch583_wifi_pending_tx_t){
            .valid = true,
            .seq = current_seq,
            .order = ++s_pending_tx_order,
            .frame_len = (size_t)frame_len,
        };
        memcpy(pending->frame, frame_text, (size_t)frame_len + 1);
    }

    if (need_printf == 1) {
        CH583_WIFI_DIRECTION_PRINTF("WiFi -> CH583: seq=%u cmd=%s arg=%s\r\n",
                                    (unsigned int)current_seq, cmd, arg ? arg : "");
    }

    ret = ch583_wifi_write_frame_text(frame_text, (size_t)frame_len);
    if (ret != 0 && pending != NULL) {
        pending->valid = false;
    }
    s_tx_seq++;

done:
    xSemaphoreGive(s_tx_mutex);
    return ret;
}

static int __attribute__((unused)) ch583_wifi_send_wifi_provision_frame(uint8_t combined_status)
{
    char body[CH583_WIFI_MAX_FRAME_BODY_LEN + 1];
    char frame_text[CH583_WIFI_MAX_FRAME_BODY_LEN + 24];
    const char cmd[] = "WIFI_PROVISION";
    int ret = -1;

    // Reserved for a possible future binary-ARG WIFI_PROVISION protocol.
    // The active protocol uses a two-character hex text ARG and ch583_wifi_send_frame().
    if (s_tx_mutex == NULL || xSemaphoreTake(s_tx_mutex, pdMS_TO_TICKS(200)) != pdTRUE) {
        UserDebugOutput_Printf("CH583_PROTO WIFI_PROVISION tx mutex unavailable/timeout\r\n");
        return -1;
    }

    uint16_t current_seq = s_tx_seq;
    int prefix_len = snprintf(body,
                              sizeof(body),
                              "V1|SEQ=%u|CMD=%s|LEN=1|PART=1|TOTAL=1|ARG=",
                              (unsigned int)current_seq,
                              cmd);
    if (prefix_len <= 0 || prefix_len + 1 >= (int)sizeof(body)) {
        UserDebugOutput_Printf("CH583_PROTO WIFI_PROVISION tx body overflow\r\n");
        goto done;
    }
    body[prefix_len] = (char)combined_status;
    size_t body_len = (size_t)prefix_len + 1U;

    uint16_t crc = ch583_wifi_uart_crc16(body, body_len);
    memcpy(frame_text, "@#", 2);
    memcpy(frame_text + 2, body, body_len);
    int suffix_len = snprintf(frame_text + 2 + body_len,
                              sizeof(frame_text) - 2 - body_len,
                              "|CRC=%04X^&\n\r",
                              crc);
    if (suffix_len <= 0 || 2U + body_len + (size_t)suffix_len >= sizeof(frame_text)) {
        UserDebugOutput_Printf("CH583_PROTO WIFI_PROVISION tx frame overflow\r\n");
        goto done;
    }
    size_t frame_len = 2U + body_len + (size_t)suffix_len;

    ch583_wifi_pending_tx_t *pending = ch583_wifi_alloc_pending_tx_locked();
    *pending = (ch583_wifi_pending_tx_t){
        .valid = true,
        .seq = current_seq,
        .order = ++s_pending_tx_order,
        .frame_len = frame_len,
    };
    memcpy(pending->frame, frame_text, frame_len);
    pending->frame[frame_len] = '\0';

