tdxguiping/ESP32_S3_epaper/main/ch583_uart/ch583_wifi_uart_protocol.c
    ret = ch583_wifi_write_frame_text(frame_text, frame_len);
    if (ret != 0) {
        pending->valid = false;
    }
    s_tx_seq++;

done:
    xSemaphoreGive(s_tx_mutex);
    return ret;
}

static int ch583_wifi_send_ack(uint16_t received_seq)
{
    char arg[8];

    snprintf(arg, sizeof(arg), "%u", (unsigned int)received_seq);
    return ch583_wifi_send_frame("ACK", arg,1);
}

static int ch583_wifi_send_err(uint16_t received_seq, const char *reason)
{
    char arg[32];

    snprintf(arg, sizeof(arg), "%u,%s", (unsigned int)received_seq, reason ? reason : "BAD_FORMAT");
    return ch583_wifi_send_frame("ERR", arg,1);
}

static uint16_t ch583_wifi_find_seq_for_error(const char *body)
{
    const char *seq = body != NULL ? strstr(body, "SEQ=") : NULL;
    char *end = NULL;
    unsigned long value = 0;

    if (seq == NULL) {
        return 0;
    }

    value = strtoul(seq + 4, &end, 10);
    if (end == seq + 4 || value > 65535UL) {
        return 0;
    }

    return (uint16_t)value;
}

static bool ch583_wifi_parse_u16_field(const char *text, const char *prefix, uint16_t *out)
{
    char *end = NULL;
    unsigned long value = 0;
    size_t prefix_len = strlen(prefix);

    if (text == NULL || out == NULL || strncmp(text, prefix, prefix_len) != 0) {
        return false;
    }

    value = strtoul(text + prefix_len, &end, 10);
    if (end == text + prefix_len || *end != '\0' || value > 65535UL) {
        return false;
    }

    *out = (uint16_t)value;
    return true;
}

static bool ch583_wifi_parse_size_field(const char *text, const char *prefix, size_t *out)
{
    char *end = NULL;
    unsigned long value = 0;
    size_t prefix_len = strlen(prefix);

    if (text == NULL || out == NULL || strncmp(text, prefix, prefix_len) != 0) {
        return false;
    }

    value = strtoul(text + prefix_len, &end, 10);
    if (end == text + prefix_len || *end != '\0') {
        return false;
    }

    *out = (size_t)value;
    return true;
}

static bool ch583_wifi_parse_u8_dec_arg(const char *arg, uint8_t *out)
{
    char *end = NULL;
    unsigned long value = 0;

    if (arg == NULL || arg[0] == '\0' || out == NULL) {
        return false;
    }

    for (const char *p = arg; *p != '\0'; p++) {
        if (*p < '0' || *p > '9') {
            return false;
        }
    }

    value = strtoul(arg, &end, 10);
    if (end == arg || *end != '\0' || value > 255UL) {
        return false;
    }

    *out = (uint8_t)value;
    return true;
}

static bool ch583_wifi_parse_app_version_byte_pair(const char *version, uint8_t *high, uint8_t *low)
{
    char *end = NULL;
    unsigned long high_value = 0;
    unsigned long low_value = 0;

    if (version == NULL || high == NULL || low == NULL) {
        return false;
    }

    high_value = strtoul(version, &end, 10);
    if (end == version || *end != '.' || high_value > 255UL) {
        return false;
    }

    const char *low_text = end + 1;
    low_value = strtoul(low_text, &end, 10);
    if (end == low_text || *end != '\0' || low_value > 255UL) {
        return false;
    }

    *high = (uint8_t)high_value;
    *low = (uint8_t)low_value;
    return true;
}

static uint16_t ch583_wifi_get_current_wifi_ver(void)
{
    const esp_app_desc_t *app = esp_app_get_description();
    uint8_t high = 0;
    uint8_t low = 0;

    if (app == NULL || !ch583_wifi_parse_app_version_byte_pair(app->version, &high, &low)) {
        ESP_LOGE(TAG, "WIFI_VER app version parse failed version=%s",
                 app != NULL ? app->version : "(null)");
        return 0;
    }

    return (uint16_t)((((uint16_t)high) << 8) | low);
}

static bool ch583_wifi_is_upper_hex_string(const char *text, size_t len)
{
    if (text == NULL) {
        return false;
    }

    for (size_t i = 0; i < len; i++) {
        char ch = text[i];
        if (!((ch >= '0' && ch <= '9') || (ch >= 'A' && ch <= 'F'))) {
            return false;
        }
    }

    return true;
}

static bool ch583_wifi_parse_hex_byte(const char *text, uint8_t *value)
{
    char *end = NULL;
    unsigned long parsed = 0;

    if (text == NULL || value == NULL || strlen(text) != 2 ||
        !ch583_wifi_is_upper_hex_string(text, 2)) {
        return false;
    }

    parsed = strtoul(text, &end, 16);
    if (end == text || *end != '\0' || parsed > 0xFFUL) {
        return false;
    }
    *value = (uint8_t)parsed;
    return true;
}

static bool ch583_wifi_parse_wake_reason(const char *text,
                                         ch583_wake_reason_t *wake_reason)
{
    if (text == NULL || wake_reason == NULL) {
        return false;
    }
    static const struct {
        const char *text;
        ch583_wake_reason_t value;
    } reasons[] = {
        {"BOOT", CH583_WAKE_REASON_BOOT},
        {"USB", CH583_WAKE_REASON_USB},
        {"KEY_PB1", CH583_WAKE_REASON_KEY_PB1},
        {"KEY_PB2", CH583_WAKE_REASON_KEY_PB2},
        {"BLE_CONNECT", CH583_WAKE_REASON_BLE_CONNECT},
        {"BLE_WRITE", CH583_WAKE_REASON_BLE_WRITE},
        {"NFC", CH583_WAKE_REASON_NFC},
        {"TIMER", CH583_WAKE_REASON_TIMER},
        {"UNKNOWN", CH583_WAKE_REASON_UNKNOWN},
    };
    for (size_t i = 0; i < sizeof(reasons) / sizeof(reasons[0]); ++i) {
        if (strcmp(text, reasons[i].text) == 0) {
            *wake_reason = reasons[i].value;
            return true;
        }
    }
    return false;
}

static const char *ch583_wifi_wake_reason_to_string(ch583_wake_reason_t wake_reason)
{
    switch (wake_reason) {
    case CH583_WAKE_REASON_BOOT: return "BOOT";
    case CH583_WAKE_REASON_USB: return "USB";
    case CH583_WAKE_REASON_KEY_PB1: return "KEY_PB1";
    case CH583_WAKE_REASON_KEY_PB2: return "KEY_PB2";
    case CH583_WAKE_REASON_BLE_CONNECT: return "BLE_CONNECT";
    case CH583_WAKE_REASON_BLE_WRITE: return "BLE_WRITE";
    case CH583_WAKE_REASON_NFC: return "NFC";
    case CH583_WAKE_REASON_TIMER: return "TIMER";
    case CH583_WAKE_REASON_UNKNOWN: return "UNKNOWN";
    default: return "INVALID";
    }
}

static ch583_wifi_device_info_parse_result_t ch583_wifi_parse_device_info_arg(
    const ch583_wifi_frame_t *frame,
    ch583_wifi_device_info_t *device_info)
{
    char arg_copy[CH583_DEVICE_INFO_ARG_MAX_LEN + 1];
    char *fields[5] = {0};
    char *separator = NULL;

    if (frame == NULL || device_info == NULL || frame->arg == NULL ||
        frame->arg_len == 0 || frame->arg_len > CH583_DEVICE_INFO_ARG_MAX_LEN) {
        return CH583_DEVICE_INFO_PARSE_BAD_ARG;
    }

    memcpy(arg_copy, frame->arg, frame->arg_len + 1);
    fields[0] = arg_copy;
    for (size_t i = 1; i < 5; ++i) {
        separator = strchr(fields[i - 1], ',');
        if (separator == NULL) {
            return CH583_DEVICE_INFO_PARSE_BAD_ARG;
        }
        *separator = '\0';
        fields[i] = separator + 1;
    }

    if (strchr(fields[4], ',') != NULL ||
        strlen(fields[0]) != CH583_DEVICE_INFO_MAC_HEX_LEN ||
        !ch583_wifi_is_upper_hex_string(fields[0], CH583_DEVICE_INFO_MAC_HEX_LEN) ||
        strlen(fields[1]) == 0 ||
        strlen(fields[1]) > CH583_DEVICE_INFO_BLE_VER_TEXT_MAX_LEN ||
        !ch583_wifi_parse_u8_dec_arg(fields[1], &device_info->ble_ver) ||
        strlen(fields[2]) != 1 ||
        (fields[2][0] != CH583_DEVICE_INFO_SCREEN_TYPE_133 &&
         fields[2][0] != CH583_DEVICE_INFO_SCREEN_TYPE_709) ||
        !ch583_wifi_parse_hex_byte(fields[3], &device_info->board_info) ||
        !ch583_wifi_parse_wake_reason(fields[4], &device_info->wake_reason)) {
        return CH583_DEVICE_INFO_PARSE_BAD_ARG;
    }

    memcpy(device_info->mac, fields[0], CH583_DEVICE_INFO_MAC_HEX_LEN + 1);
    device_info->screen_type = fields[2][0];

    if (device_info->screen_type == CH583_DEVICE_INFO_SCREEN_TYPE_133 &&
        device_info->board_info == CH583_DEVICE_INFO_BOARD_XINGTAI) {
        device_info->epd_type = EPD_TYPE_1600_1200_133;
    } else if (device_info->screen_type == CH583_DEVICE_INFO_SCREEN_TYPE_133 &&
               device_info->board_info == CH583_DEVICE_INFO_BOARD_DKE) {
        device_info->epd_type = EPD_TYPE_1600_1200_133_DKE;
    } else if (device_info->screen_type == CH583_DEVICE_INFO_SCREEN_TYPE_709 &&
               device_info->board_info == CH583_DEVICE_INFO_BOARD_XINGTAI) {
        device_info->epd_type = EPD_TYPE_1600_1200_79;
    } else {
        return CH583_DEVICE_INFO_PARSE_UNSUPPORTED_EPD;
    }

    return CH583_DEVICE_INFO_PARSE_OK;
}

static bool ch583_wifi_parse_reply_seq_arg(const char *arg, uint16_t *seq_out)
{
    char *end = NULL;
    unsigned long value = 0;

    if (arg == NULL || seq_out == NULL) {
        return false;
    }

    value = strtoul(arg, &end, 10);
    if (end == arg || value > 65535UL) {
        return false;
    }

    if (*end != '\0' && *end != ',') {
        return false;
    }

    *seq_out = (uint16_t)value;
    return true;
}

