tdxguiping/ESP32_S3_epaper/main/ch583_uart/ch583_wifi_uart_protocol.c
static void ch583_wifi_handle_reply_status(const ch583_wifi_frame_t *frame)
{
    uint16_t reply_seq = 0;

    if (frame == NULL || frame->arg == NULL) {
        return;
    }

    if (!ch583_wifi_parse_reply_seq_arg(frame->arg, &reply_seq)) {
        return;
    }

    if (s_tx_mutex == NULL || xSemaphoreTake(s_tx_mutex, pdMS_TO_TICKS(200)) != pdTRUE) {
        return;
    }

    ch583_wifi_pending_tx_t *pending = ch583_wifi_find_pending_tx_locked(reply_seq);
    if (pending == NULL) {
        xSemaphoreGive(s_tx_mutex);
        return;
    }

    if (strcmp(frame->cmd, "ERR") == 0 && strstr(frame->arg, "BAD_CRC") != NULL) {
        (void)ch583_wifi_retry_pending_frame_locked(pending);
        xSemaphoreGive(s_tx_mutex);
        return;
    }

    // Any non-BAD_CRC reply completes the matching pending frame only.
    pending->valid = false;
    xSemaphoreGive(s_tx_mutex);
}

static void ch583_wifi_check_rx_seq_gap(const ch583_wifi_frame_t *frame)
{
    if (frame == NULL) {
        return;
    }

    if (s_rx_seq_seen) {
        uint16_t expected_seq = (uint16_t)(s_last_rx_seq + 1U);
        if (frame->seq != expected_seq) {
            uint16_t lost_count = (uint16_t)(frame->seq - expected_seq);
            UserDebugOutput_Printf("E ch583_proto: CH583 RX seq gap last=%u expected=%u now=%u lost=%u cmd=%s\r\n",
                                   (unsigned int)s_last_rx_seq,
                                   (unsigned int)expected_seq,
                                   (unsigned int)frame->seq,
                                   (unsigned int)lost_count,
                                   frame->cmd);
        }
    }

    s_last_rx_seq = frame->seq;
    s_rx_seq_seen = true;
}

static bool ch583_wifi_parse_frame(char *body, ch583_wifi_frame_t *frame, uint16_t *crc_received, const char **error_reason)
{
    char *crc_pos = NULL;
    char *save = NULL;
    char *field = NULL;
    char *fields[8] = {0};
    int field_count = 0;
    char *end = NULL;
    unsigned long crc_value = 0;
    uint16_t crc_calc = 0;
    size_t crc_input_len = 0;

    if (body == NULL || frame == NULL || crc_received == NULL) {
        if (error_reason != NULL) {
            *error_reason = "BAD_FORMAT";
        }
        return false;
    }

    memset(frame, 0, sizeof(*frame));
    crc_pos = strstr(body, "|CRC=");
    if (crc_pos == NULL) {
        CH583_WIFI_DEBUG_PRINTF("CH583_PROTO bad format no CRC body_len=%u\r\n",
                                (unsigned int)strlen(body));
        if (error_reason != NULL) {
            *error_reason = "BAD_FORMAT";
        }
        return false;
    }

    crc_input_len = (size_t)(crc_pos - body);
    crc_value = strtoul(crc_pos + 5, &end, 16);
    if (end == crc_pos + 5 || *end != '\0' || crc_value > 0xFFFFUL) {
        CH583_WIFI_DEBUG_PRINTF("CH583_PROTO bad format crc text=%s\r\n", crc_pos + 5);
        if (error_reason != NULL) {
            *error_reason = "BAD_FORMAT";
        }
        return false;
    }

    crc_calc = ch583_wifi_uart_crc16(body, crc_input_len);
    *crc_received = (uint16_t)crc_value;
    if (crc_calc != *crc_received) {
        CH583_WIFI_DEBUG_PRINTF("CH583_PROTO bad crc calc=%04X recv=%04X body_len=%u\r\n",
               crc_calc,
               *crc_received,
               (unsigned int)crc_input_len);
        if (error_reason != NULL) {
            *error_reason = "BAD_CRC";
        }
        return false;
    }

    *crc_pos = '\0';
    field = strtok_r(body, "|", &save);
    while (field != NULL && field_count < (int)(sizeof(fields) / sizeof(fields[0]))) {
        fields[field_count++] = field;
        field = strtok_r(NULL, "|", &save);
    }

    if (field_count != 7 || strcmp(fields[0], "V1") != 0 ||
        !ch583_wifi_parse_u16_field(fields[1], "SEQ=", &frame->seq) ||
        strncmp(fields[2], "CMD=", 4) != 0 ||
        !ch583_wifi_parse_size_field(fields[3], "LEN=", &frame->arg_len) ||
        !ch583_wifi_parse_u16_field(fields[4], "PART=", &frame->part) ||
        !ch583_wifi_parse_u16_field(fields[5], "TOTAL=", &frame->total) ||
        strncmp(fields[6], "ARG=", 4) != 0) {
        CH583_WIFI_DEBUG_PRINTF("CH583_PROTO bad format fields=%d\r\n", field_count);
        if (error_reason != NULL) {
            *error_reason = "BAD_FORMAT";
        }
        return false;
    }

    snprintf(frame->cmd, sizeof(frame->cmd), "%s", fields[2] + 4);
    frame->arg = fields[6] + 4;
    if (error_reason != NULL) {
        *error_reason = NULL;
    }
    return true;
}

static bool ch583_wifi_validate_len_and_part(const ch583_wifi_frame_t *frame)
{
    size_t real_arg_len = 0;

    if (frame == NULL || frame->arg == NULL) {
        return false;
    }

    real_arg_len = strlen(frame->arg);
    if (frame->arg_len != real_arg_len || frame->arg_len > CH583_WIFI_MAX_ARG_LEN) {
        CH583_WIFI_DEBUG_PRINTF("CH583_PROTO bad len seq=%u cmd=%s len=%u real=%u\r\n",
               (unsigned int)frame->seq,
               frame->cmd,
               (unsigned int)frame->arg_len,
               (unsigned int)real_arg_len);
        ch583_wifi_send_err(frame->seq, "BAD_LEN");
        return false;
    }

    if (frame->part == 0 || frame->total == 0 || frame->part > frame->total ||
        (frame->total == 1 && frame->part != 1)) {
        CH583_WIFI_DEBUG_PRINTF("CH583_PROTO bad part seq=%u cmd=%s part=%u total=%u\r\n",
               (unsigned int)frame->seq,
               frame->cmd,
               (unsigned int)frame->part,
               (unsigned int)frame->total);
        ch583_wifi_send_err(frame->seq, "BAD_PART");
        return false;
    }

    if (frame->total > 1 && strcmp(frame->cmd, "BLE_DATA") != 0) {
        CH583_WIFI_DEBUG_PRINTF("CH583_PROTO bad part seq=%u cmd=%s total=%u non-ble split\r\n",
               (unsigned int)frame->seq,
               frame->cmd,
               (unsigned int)frame->total);
        ch583_wifi_send_err(frame->seq, "BAD_PART");
        return false;
    }

    return true;
}

static void ch583_wifi_reset_ble_join(void)
{
    if (s_ble_activity_active) {
        UserLedStatus_ActivityEnd(USER_LED_ACTIVITY_UART_RX);
        s_ble_activity_active = false;
    }
    s_ble_join_active = false;
    s_ble_expected_part = 0;
    s_ble_total = 0;
    s_ble_len = 0;
}

static bool ch583_wifi_admit_and_ack_ble_data(
    uint16_t seq,
    const char *data,
    ch583_wifi_ble_data_callback_t ble_data_callback)
{
    if (ble_data_callback == NULL) {
        return ch583_wifi_send_ack(seq) == 0;
    }

    esp_err_t ret =
        ble_data_callback(data, CH583_WIFI_BLE_DATA_ADMIT);
    if (ret != ESP_OK) {
        ch583_wifi_send_err(seq, ret == ESP_ERR_NO_MEM ? "NO_MEM" : "BUSY");
        return false;
    }
    if (ch583_wifi_send_ack(seq) != 0) {
        (void)ble_data_callback(NULL, CH583_WIFI_BLE_DATA_CANCEL);
        return false;
    }
    ret = ble_data_callback(NULL, CH583_WIFI_BLE_DATA_COMMIT);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "BLE_DATA commit failed after ACK seq=%u ret=%s",
                 (unsigned int)seq, esp_err_to_name(ret));
        return false;
    }
    return true;
}

