tdxguiping/ESP32_S3_epaper/main/ch583_uart/ch583_wifi_uart_protocol.c
static bool ch583_wifi_handle_ble_data(const ch583_wifi_frame_t *frame,
                                       ch583_wifi_ble_data_callback_t ble_data_callback)
{
    if (frame == NULL) {
        return false;
    }

    if (frame->total == 1) {
        bool activity_active = frame->arg_len >= USER_LED_UART_LARGE_DATA_THRESHOLD;
        CH583_WIFI_DEBUG_PRINTF("CH583_PROTO ble single seq=%u len=%u data=%s\r\n",
               (unsigned int)frame->seq,
               (unsigned int)frame->arg_len,
               frame->arg);
        ServerNetworkStaWifiWorkTime_OnCh583Activity();
        if (activity_active) {
            UserLedStatus_ActivityBegin(USER_LED_ACTIVITY_UART_RX);
        }
        bool accepted = ch583_wifi_admit_and_ack_ble_data(
            frame->seq, frame->arg, ble_data_callback);
        if (activity_active) {
            UserLedStatus_ActivityEnd(USER_LED_ACTIVITY_UART_RX);
        }
        return accepted;
    }

    if (frame->part == 1) {
        ch583_wifi_reset_ble_join();
        s_ble_join_active = true;
        s_ble_activity_active = true;
        UserLedStatus_ActivityBegin(USER_LED_ACTIVITY_UART_RX);
        s_ble_expected_part = 1;
        s_ble_total = frame->total;
        CH583_WIFI_DEBUG_PRINTF("CH583_PROTO ble join start seq=%u total=%u\r\n",
               (unsigned int)frame->seq,
               (unsigned int)frame->total);
    }

    if (!s_ble_join_active || frame->total != s_ble_total || frame->part != s_ble_expected_part) {
        CH583_WIFI_DEBUG_PRINTF("CH583_PROTO ble join bad part seq=%u part=%u expected=%u total=%u cached_total=%u\r\n",
               (unsigned int)frame->seq,
               (unsigned int)frame->part,
               (unsigned int)s_ble_expected_part,
               (unsigned int)frame->total,
               (unsigned int)s_ble_total);
        ch583_wifi_reset_ble_join();
        ch583_wifi_send_err(frame->seq, "BAD_PART");
        return false;
    }

    if (s_ble_len + frame->arg_len > CH583_WIFI_MAX_BLE_MESSAGE_LEN) {
        CH583_WIFI_DEBUG_PRINTF("CH583_PROTO ble join overflow seq=%u cached=%u add=%u max=%u\r\n",
               (unsigned int)frame->seq,
               (unsigned int)s_ble_len,
               (unsigned int)frame->arg_len,
               (unsigned int)sizeof(s_ble_buf));
        ch583_wifi_reset_ble_join();
        ch583_wifi_send_err(frame->seq, "BAD_LEN");
        return false;
    }

    ServerNetworkStaWifiWorkTime_OnCh583Activity();
    memcpy(&s_ble_buf[s_ble_len], frame->arg, frame->arg_len);
    s_ble_len += frame->arg_len;
    s_ble_buf[s_ble_len] = '\0';
    s_ble_expected_part++;
    if (frame->part == frame->total) {
        CH583_WIFI_DEBUG_PRINTF("CH583_PROTO ble join done seq=%u total_len=%u\r\n",
               (unsigned int)frame->seq,
               (unsigned int)s_ble_len);
        bool accepted = ch583_wifi_admit_and_ack_ble_data(
            frame->seq, s_ble_buf, ble_data_callback);
        ch583_wifi_reset_ble_join();
        return accepted;
    }
    ch583_wifi_send_ack(frame->seq);
    return true;
}

static const char *ch583_wifi_key_action_to_string(ch583_key_id_t key)
{
    return key == CH583_KEY_PB2 ? "LOCAL_BROWSING" : "FACTORY_RESET";
}

static esp_err_t ch583_wifi_dispatch_key_action(ch583_key_source_t source,
                                                ch583_key_id_t key,
                                                uint16_t protocol_seq)
{
    if (key == CH583_KEY_PB2) {
        local_image_browsing_trigger_t trigger =
            source == CH583_KEY_SOURCE_DEVICE_INFO
                ? LOCAL_IMAGE_BROWSING_TRIGGER_DEVICE_INFO_KEY_PB2
                : LOCAL_IMAGE_BROWSING_TRIGGER_KEY_EVENT_PB2_PRESS;
        return LocalImageBrowsing_RequestNext(trigger, protocol_seq);
    }
    if (key == CH583_KEY_PB1) {
        factory_reset_trigger_t trigger =
            source == CH583_KEY_SOURCE_DEVICE_INFO
                ? FACTORY_RESET_TRIGGER_DEVICE_INFO_KEY_PB1
                : FACTORY_RESET_TRIGGER_KEY_EVENT_PB1_PRESS;
        return FactoryReset_Request(trigger, protocol_seq);
    }
    return ESP_ERR_INVALID_ARG;
}

static void ch583_wifi_handle_device_info(const ch583_wifi_frame_t *frame)
{
    ch583_wifi_device_info_t device_info = {0};
    ch583_wifi_device_info_parse_result_t parse_result;
    uint8_t saved_epd_type = USER_EPD_TYPE_DEFAULT;
    bool epd_saved_changed = false;
    bool was_received = s_device_info_received;
    esp_err_t ret;

    if (frame == NULL) {
        return;
    }

    if (frame->part != 1 || frame->total != 1) {
        ESP_LOGE(TAG, "DEVICE_INFO bad part seq=%u part=%u total=%u",
                 (unsigned int)frame->seq,
                 (unsigned int)frame->part,
                 (unsigned int)frame->total);
        ch583_wifi_send_err(frame->seq, "BAD_PART");
        return;
    }

    parse_result = ch583_wifi_parse_device_info_arg(frame, &device_info);
    if (parse_result == CH583_DEVICE_INFO_PARSE_UNSUPPORTED_EPD) {
        ESP_LOGE(TAG,
                 "DEVICE_INFO unsupported EPD mapping seq=%u screen_type=%c board_info_hex=%02X",
                 (unsigned int)frame->seq,
                 device_info.screen_type,
                 (unsigned int)device_info.board_info);
        ch583_wifi_send_err(frame->seq, "BAD_ARG");
        return;
    }
    if (parse_result != CH583_DEVICE_INFO_PARSE_OK) {
        ESP_LOGE(TAG, "DEVICE_INFO bad arg seq=%u len=%u arg=%s",
                 (unsigned int)frame->seq,
                 (unsigned int)frame->arg_len,
                 frame->arg);
        ch583_wifi_send_err(frame->seq, "BAD_ARG");
        return;
    }

    ret = EpdType_LoadSavedOrDefault();
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "DEVICE_INFO load EPD type failed seq=%u ret=%s",
                 (unsigned int)frame->seq, esp_err_to_name(ret));
        ch583_wifi_send_err(frame->seq, CH583_DEVICE_INFO_ERR_SAVE_FAILED);
        return;
    }

    // Keep the active driver selected from startup NVS (or its validated default).
    // DEVICE_INFO may arrive during a display, so only persist it for the next boot.
    ret = EpdType_SaveForNextBoot(device_info.epd_type, &epd_saved_changed);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "DEVICE_INFO save EPD type=%u failed seq=%u ret=%s",
                 (unsigned int)device_info.epd_type,
                 (unsigned int)frame->seq,
                 esp_err_to_name(ret));
        ch583_wifi_send_err(frame->seq, CH583_DEVICE_INFO_ERR_SAVE_FAILED);
        return;
    }

    // Verify NVS after an unchanged RAM value so a previous failed write cannot be acknowledged.
    ret = app_nvs_read_u8(USER_EPD_TYPE_NVS_KEY, &saved_epd_type, USER_EPD_TYPE_DEFAULT);
    if (ret != ESP_OK || saved_epd_type != device_info.epd_type) {
        ret = app_nvs_write_u8(USER_EPD_TYPE_NVS_KEY, device_info.epd_type);
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "DEVICE_INFO verify EPD type=%u failed seq=%u ret=%s",
                     (unsigned int)device_info.epd_type,
                     (unsigned int)frame->seq,
                     esp_err_to_name(ret));
            ch583_wifi_send_err(frame->seq, CH583_DEVICE_INFO_ERR_SAVE_FAILED);
            return;
        }
    }

    if (strcmp(s_ble_mac, device_info.mac) != 0) {
        ret = app_nvs_write_str(CH583_DEVICE_INFO_MAC_NVS_KEY, device_info.mac);
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "DEVICE_INFO save MAC failed seq=%u ret=%s",
                     (unsigned int)frame->seq, esp_err_to_name(ret));
            ch583_wifi_send_err(frame->seq, CH583_DEVICE_INFO_ERR_SAVE_FAILED);
            return;
        }
    }
    if (!s_ble_ver_nvs_valid || s_ble_ver != device_info.ble_ver) {
        ret = app_nvs_write_u8(CH583_DEVICE_INFO_BLE_VER_NVS_KEY, device_info.ble_ver);
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "DEVICE_INFO save BLE version=%u failed seq=%u ret=%s",
                     (unsigned int)device_info.ble_ver,
                     (unsigned int)frame->seq,
                     esp_err_to_name(ret));
            ch583_wifi_send_err(frame->seq, CH583_DEVICE_INFO_ERR_SAVE_FAILED);
            return;
        }
        s_ble_ver_nvs_valid = true;
    }

    memcpy(s_ble_mac, device_info.mac, CH583_DEVICE_INFO_MAC_HEX_LEN + 1);
    s_ble_ver = device_info.ble_ver;
    ServerNetworkStaWifiWorkTime_OnCh583Activity();

    if (ch583_wifi_send_ack(frame->seq) != 0) {
        ESP_LOGE(TAG, "DEVICE_INFO ACK send failed seq=%u", (unsigned int)frame->seq);
        return;
    }

    s_device_info_received = true;
    if (was_received) {
        ESP_LOGW(TAG, "DEVICE_INFO repeated seq=%u wake_reason=%s, ACK sent again",
                 (unsigned int)frame->seq,
                 ch583_wifi_wake_reason_to_string(device_info.wake_reason));
    } else {
        ESP_LOGI(TAG,
                 "DEVICE_INFO synced seq=%u MAC=%s BLE version=%u screen=%c board=%02X wake_reason=%s(%u) reported_epd=%u active_epd=%u saved_changed=%d",
                 (unsigned int)frame->seq,
                 s_ble_mac,
                 (unsigned int)s_ble_ver,
                 device_info.screen_type,
                 (unsigned int)device_info.board_info,
                 ch583_wifi_wake_reason_to_string(device_info.wake_reason),
                 (unsigned int)device_info.wake_reason,
                 (unsigned int)device_info.epd_type,
                 (unsigned int)EPD_type,
                 epd_saved_changed ? 1 : 0);
    }

    if (ch583_wifi_uart_send_wifi_ver(ch583_wifi_get_current_wifi_ver()) != 0) {
        ESP_LOGE(TAG, "DEVICE_INFO WIFI_VER send failed seq=%u", (unsigned int)frame->seq);
    }
    if (ch583_wifi_uart_send_current_wifi_provision_status() != 0) {
        ESP_LOGE(TAG, "DEVICE_INFO WIFI_PROVISION replay failed seq=%u",
                 (unsigned int)frame->seq);
    }
    if (!was_received) {
        esp_err_t led_ret = UserLedStatus_ReapplyCurrent();
        if (led_ret != ESP_OK) {
            ESP_LOGE(TAG, "DEVICE_INFO LED reapply request failed seq=%u ret=%s",
                     (unsigned int)frame->seq, esp_err_to_name(led_ret));
        }
        if (ServerNetworkStaTime_IsReliableForRtcRestore()) {
            esp_err_t time_ret =
                ServerNetworkStaTime_BackupCurrentToCh583("device_info_synced");
            if (time_ret != ESP_OK) {
                ESP_LOGE(TAG, "DEVICE_INFO TIME_SET replay failed seq=%u ret=%s",
                         (unsigned int)frame->seq, esp_err_to_name(time_ret));
            }
        }
    }

    if (!was_received) {
        ch583_key_id_t key = 0;
        if (device_info.wake_reason == CH583_WAKE_REASON_KEY_PB1) {
            key = CH583_KEY_PB1;
        } else if (device_info.wake_reason == CH583_WAKE_REASON_KEY_PB2) {
            key = CH583_KEY_PB2;
        }
        if (key != 0) {
            esp_err_t action_ret = ch583_wifi_dispatch_key_action(
                CH583_KEY_SOURCE_DEVICE_INFO, key, frame->seq);
            if (action_ret == ESP_OK) {
                ESP_LOGI(TAG,
                         "DEVICE_INFO key action seq=%u key=PB%u action=%s",
                         (unsigned int)frame->seq,
                         (unsigned int)key,
                         ch583_wifi_key_action_to_string(key));
            } else {
                ESP_LOGE(TAG,
                         "DEVICE_INFO key action request failed seq=%u key=PB%u action=%s ret=%s",
                         (unsigned int)frame->seq,
                         (unsigned int)key,
                         ch583_wifi_key_action_to_string(key),
                         esp_err_to_name(action_ret));
            }
        }
    }
}

static void ch583_wifi_handle_key_event(const ch583_wifi_frame_t *frame)
{
    if (frame == NULL) {
        return;
    }
    if (frame->part != 1 || frame->total != 1) {
        ESP_LOGE(TAG, "KEY_EVENT bad part seq=%u part=%u total=%u",
                 (unsigned int)frame->seq,
                 (unsigned int)frame->part,
                 (unsigned int)frame->total);
        ch583_wifi_send_err(frame->seq, "BAD_PART");
        return;
    }
    ch583_key_id_t key;
    if (frame->arg_len == strlen(LOCAL_IMAGE_BROWSING_KEY_EVENT_ARG) &&
        strcmp(frame->arg, LOCAL_IMAGE_BROWSING_KEY_EVENT_ARG) == 0) {
        key = CH583_KEY_PB2;
    } else if (strcmp(frame->arg, "PB1,PRESS") == 0) {
        key = CH583_KEY_PB1;
    } else {
        ESP_LOGE(TAG, "KEY_EVENT bad arg seq=%u len=%u arg=%s",
                 (unsigned int)frame->seq,
                 (unsigned int)frame->arg_len,
                 frame->arg);
        ch583_wifi_send_err(frame->seq, "BAD_ARG");
        return;
    }

    ServerNetworkStaWifiWorkTime_OnCh583Activity();
    if (ch583_wifi_send_ack(frame->seq) != 0) {
        ESP_LOGE(TAG, "KEY_EVENT ACK send failed seq=%u", (unsigned int)frame->seq);
        return;
    }
    if (s_key_event_seq_seen && s_last_key_event_seq == frame->seq) {
        ESP_LOGI(TAG,
                 "KEY_EVENT duplicate seq=%u key=PB%u, ACK sent without repeat action",
                 (unsigned int)frame->seq,
                 (unsigned int)key);
        return;
    }
    s_key_event_seq_seen = true;
    s_last_key_event_seq = frame->seq;

    esp_err_t action_ret = ch583_wifi_dispatch_key_action(
        CH583_KEY_SOURCE_KEY_EVENT, key, frame->seq);
    const char *action = ch583_wifi_key_action_to_string(key);
    if (action_ret == ESP_OK) {
        ESP_LOGI(TAG,
                 "KEY_EVENT accepted seq=%u key=PB%u action=%s",
                 (unsigned int)frame->seq,
                 (unsigned int)key,
                 action);
    } else {
        ESP_LOGE(TAG,
                 "KEY_EVENT action request failed seq=%u key=PB%u action=%s ret=%s",
                 (unsigned int)frame->seq,
                 (unsigned int)key,
                 action,
                 esp_err_to_name(action_ret));
    }
}

