tdxguiping/ESP32_S3_epaper/main/ch583_uart/ch583_wifi_uart_protocol.c
static void ch583_wifi_handle_frame_body(const char *body, ch583_wifi_ble_data_callback_t ble_data_callback)
{
    char parse_buf[CH583_WIFI_MAX_FRAME_BODY_LEN + 1];
    ch583_wifi_frame_t frame;
    uint16_t crc_received = 0;
    uint16_t error_seq = ch583_wifi_find_seq_for_error(body);
    const char *error_reason = NULL;

    snprintf(parse_buf, sizeof(parse_buf), "%s", body);
    if (!ch583_wifi_parse_frame(parse_buf, &frame, &crc_received, &error_reason)) {
        ch583_wifi_send_err(error_seq, error_reason);
        return;
    }

    // PING/PONG runs continuously. Suppress its routine direction/debug output,
    // while keeping parsing, validation, PONG replies, and error logs unchanged.
    if (strcmp(frame.cmd, "PING") != 0) {
        CH583_WIFI_DIRECTION_PRINTF("CH583 -> WiFi: seq=%u cmd=%s arg=%s\r\n",
               (unsigned int)frame.seq, frame.cmd, frame.arg);
        CH583_WIFI_DEBUG_PRINTF("CH583_PROTO rx seq=%u cmd=%s len=%u part=%u total=%u crc=%04X arg=%s\r\n",
               (unsigned int)frame.seq,
               frame.cmd,
               (unsigned int)frame.arg_len,
               (unsigned int)frame.part,
               (unsigned int)frame.total,
               crc_received,
               frame.arg);
    }

    if (!ch583_wifi_validate_len_and_part(&frame)) {
        return;
    }
    ch583_wifi_check_rx_seq_gap(&frame);
    if (strcmp(frame.cmd, CH583_DEVICE_INFO_CMD) == 0) {
        ch583_wifi_handle_device_info(&frame);
    } else if (strcmp(frame.cmd, CH583_KEY_EVENT_CMD) == 0) {
        ch583_wifi_handle_key_event(&frame);
    } else if (strcmp(frame.cmd, "PING") == 0) {
        char arg[8];
        snprintf(arg, sizeof(arg), "%u", (unsigned int)frame.seq);
        if (ch583_wifi_send_frame("PONG", arg, 0) != 0) {
            ESP_LOGE(TAG, "PONG send failed seq=%u", (unsigned int)frame.seq);
        }
    } else if (strcmp(frame.cmd, "BLE_DATA") == 0) {
        // Record validated BLE activity without shortening the mandatory rail-off interval.
        EpdSdPowerTest_OnCh583BleDataReceived();
        if (ch583_wifi_handle_ble_data(&frame, ble_data_callback)) {
            // Preserve the original full work timer reset only for accepted BLE data.
            ServerNetworkStaWifiWorkTime_OnNetworkData();
        }
    } else if (strcmp(frame.cmd, "FACTORY_DATA") == 0) {
        uint32_t admission = 0U;
        esp_err_t ret = Ch583FactoryTest_Admit(frame.seq,
                                               frame.arg,
                                               frame.arg_len,
                                               &admission);
        if (ret == ESP_OK) {
            if (ch583_wifi_send_ack(frame.seq) != 0) {
                ESP_LOGE(TAG, "FACTORY_DATA ACK send failed seq=%u",
                         (unsigned int)frame.seq);
                Ch583FactoryTest_CancelAdmission(admission);
            } else {
                ret = Ch583FactoryTest_Commit(admission);
                if (ret != ESP_OK) {
                    ESP_LOGE(TAG,
                             "FACTORY_DATA commit failed seq=%u ret=%s",
                             (unsigned int)frame.seq,
                             esp_err_to_name(ret));
                    Ch583FactoryTest_CancelAdmission(admission);
                }
            }
        } else {
            const char *reason = ret == ESP_ERR_NO_MEM ? "NO_MEM" :
                                 ret == ESP_ERR_INVALID_ARG ? "BAD_ARG" :
                                 "BUSY";
            ch583_wifi_send_err(frame.seq, reason);
        }
    } else if (strcmp(frame.cmd, "ACK") == 0 ||
               strcmp(frame.cmd, "ERR") == 0 ||
               strcmp(frame.cmd, "PONG") == 0 ||
               strcmp(frame.cmd, "GPIO_VALUE") == 0 ||
               strcmp(frame.cmd, "TIME_STATUS") == 0 ||
               strcmp(frame.cmd, "NFC_STATUS") == 0) {
        if (strcmp(frame.cmd, "TIME_STATUS") == 0) {
            ServerNetworkStaTime_OnCh583TimeStatus(frame.arg);
        }
        ch583_wifi_handle_reply_status(&frame);
        CH583_WIFI_DEBUG_PRINTF("CH583_PROTO status cmd=%s arg=%s\r\n", frame.cmd, frame.arg);
    } else {
        ESP_LOGE(TAG, "unsupported cmd=%s seq=%u", frame.cmd, (unsigned int)frame.seq);
        ch583_wifi_send_err(frame.seq, "BAD_CMD");
    }
}

void ch583_wifi_uart_process_bytes(const uint8_t *data, size_t len, ch583_wifi_ble_data_callback_t ble_data_callback)
{
    if (data == NULL || len == 0) {
        return;
    }

    for (size_t i = 0; i < len; i++) {
        uint8_t byte = data[i];

        if (!s_in_frame) {
            if (s_wait_frame_start_hash) {
                if (byte == '#') {
                    s_in_frame = true;
                    s_frame_body_len = 0;
                    CH583_WIFI_DEBUG_PRINTF("CH583_PROTO frame start\r\n");
                }
                s_wait_frame_start_hash = false;
            } else if (byte == '@') {
                s_wait_frame_start_hash = true;
            }
            continue;
        }

        if (byte == '&' && s_frame_body_len > 0 && s_frame_body[s_frame_body_len - 1] == '^') {
            s_frame_body_len--;
            s_frame_body[s_frame_body_len] = '\0';
            CH583_WIFI_DEBUG_PRINTF("CH583_PROTO frame end body_len=%u\r\n",
                                    (unsigned int)s_frame_body_len);
            ch583_wifi_handle_frame_body(s_frame_body, ble_data_callback);
            s_in_frame = false;
            s_frame_body_len = 0;
            continue;
        }

        if (s_frame_body_len >= CH583_WIFI_MAX_FRAME_BODY_LEN) {
            CH583_WIFI_DEBUG_PRINTF("CH583_PROTO frame overflow max=%u\r\n", (unsigned int)CH583_WIFI_MAX_FRAME_BODY_LEN);
            s_in_frame = false;
            s_frame_body_len = 0;
            ch583_wifi_send_err(0, "BAD_FORMAT");
            continue;
        }

        s_frame_body[s_frame_body_len++] = (char)byte;
        s_frame_body[s_frame_body_len] = '\0';
    }
}

int ch583_wifi_uart_send_wifi_data(const char *message)
{
    size_t len = 0;

    if (message == NULL) {
        return -1;
    }

    len = strlen(message);
    if (len > CH583_WIFI_MAX_WIFI_DATA_LEN) {
        UserDebugOutput_Printf("CH583_PROTO WIFI_DATA too long len=%u max=%u\r\n",
               (unsigned int)len,
               (unsigned int)CH583_WIFI_MAX_WIFI_DATA_LEN);
        return -1;
    }
    bool activity_active = len >= USER_LED_UART_LARGE_DATA_THRESHOLD;
    if (activity_active) {
        UserLedStatus_ActivityBegin(USER_LED_ACTIVITY_UART_TX);
    }
    // Send WiFi-to-frontend data as one WIFI_DATA frame.
    int ret = ch583_wifi_send_frame("WIFI_DATA", message,1);
    if (activity_active) {
        UserLedStatus_ActivityEnd(USER_LED_ACTIVITY_UART_TX);
    }
    return ret;
}

int ch583_wifi_uart_send_factory_result(const char *result)
{
    if (result == NULL || result[0] == '\0') {
        return -1;
    }
    return ch583_wifi_send_frame("FACTORY_RESULT", result, 1);
}

int ch583_wifi_uart_send_wifi_provision_status(uint8_t status)
{
    if (status != 0U && status != 1U) {
        UserDebugOutput_Printf("CH583_PROTO WIFI_PROVISION reject bad status=%u\r\n",
                               (unsigned int)status);
        return -1;
    }

