tdxguiping/ESP32_S3_epaper/main/ch583_uart/ch583_wifi_uart_protocol.c
    s_wifi_provision_status = status;
    s_wifi_provision_status_valid = true;

    uint8_t mode = EpdDisplayMode_Get();
    if (mode > USER_EPD_DISPLAY_MODE_LOCAL_IMAGE_BROWSING) {
        mode = USER_EPD_DISPLAY_MODE_NORMAL;
    }
    uint8_t provision_nibble = (status == 1U) ? 0x5U : 0x4U;
    uint8_t combined_status = (uint8_t)((provision_nibble << 4) | (mode & 0x0FU));
    char status_hex[3];
    snprintf(status_hex, sizeof(status_hex), "%02X", (unsigned int)combined_status);

    int ret = ch583_wifi_send_frame("WIFI_PROVISION", status_hex, 1);
    UserDebugOutput_Printf("CH583_PROTO WIFI_PROVISION provision=%u mode=%u combined=0x%02X arg=%s send_ret=%d\r\n",
                           (unsigned int)status,
                           (unsigned int)mode,
                           (unsigned int)combined_status,
                           status_hex,
                           ret);
    return ret;
}

int ch583_wifi_uart_send_current_wifi_provision_status(void)
{
    if (!s_wifi_provision_status_valid) {
        s_wifi_provision_status = 0U;
        s_wifi_provision_status_valid = true;
    }
    return ch583_wifi_uart_send_wifi_provision_status(s_wifi_provision_status);
}

int ch583_wifi_uart_send_wifi_provision_before_power_off(bool slideshow_enabled)
{
    return ch583_wifi_uart_send_wifi_provision_mode_before_power_off(
        slideshow_enabled ? USER_EPD_DISPLAY_MODE_SLIDESHOW :
                            USER_EPD_DISPLAY_MODE_NORMAL);
}

int ch583_wifi_uart_send_wifi_provision_mode_before_power_off(uint8_t mode)
{
    // This is a one-shot CH583 notification. Do not update the cached provision
    // status or persistent EPD mode. Non-scheduled NORMAL and local browsing use
    // standby while scheduled modes remain visible for CH583 wake policy.
    uint8_t provision_status = s_wifi_provision_status_valid ? s_wifi_provision_status : 0U;
    uint8_t provision_nibble = (provision_status == 1U) ? 0x5U : 0x4U;
    uint8_t shutdown_mode;
    if (mode == USER_EPD_DISPLAY_MODE_SLIDESHOW ||
        mode == USER_EPD_DISPLAY_MODE_DAILY) {
        shutdown_mode = mode;
    } else {
        shutdown_mode = CH583_WIFI_PROVISION_MODE_STANDBY;
    }
    uint8_t combined_status =
        (uint8_t)((provision_nibble << 4) | (shutdown_mode & 0x0FU));
    char status_hex[3];

    snprintf(status_hex, sizeof(status_hex), "%02X", (unsigned int)combined_status);
    return ch583_wifi_send_frame("WIFI_PROVISION", status_hex, 1);
}

const char *ch583_wifi_uart_get_ble_mac(void)
{
    ch583_wifi_load_device_info_from_nvs();
    return s_ble_mac[0] != '\0' ? s_ble_mac : NULL;
}

uint8_t ch583_wifi_uart_get_ble_ver(void)
{
    ch583_wifi_load_device_info_from_nvs();
    return s_ble_ver;
}

int ch583_wifi_uart_send_wifi_ver(uint16_t wifi_ver)
{
    char arg[8];

    snprintf(arg, sizeof(arg), "%u", (unsigned int)wifi_ver);
    return ch583_wifi_send_frame("WIFI_VER", arg, 1);
}

int ch583_wifi_uart_send_wake_timer_on(uint32_t seconds)
{
    char arg[24];

    if (seconds < CH583_WAKE_TIMER_MIN_SECONDS ||
        seconds > CH583_WAKE_TIMER_MAX_SECONDS) {
        return -1;
    }

    snprintf(arg, sizeof(arg), "ON,%lu", (unsigned long)seconds);
    return ch583_wifi_send_frame("WAKE_TIMER", arg, 1);
}

int ch583_wifi_uart_send_wake_timer_off(void)
{
    return ch583_wifi_send_frame("WAKE_TIMER", "OFF,0", 1);
}

int ch583_wifi_uart_send_nfc_set_json(const char *json)
{
    char encoded[CH583_WIFI_NFC_BASE64URL_MAX_LEN + 1];
    size_t json_len;
    int encoded_len;

    if (json == NULL) {
        return -1;
    }

    json_len = strlen(json);
    if (json_len == 0 || json_len > CH583_WIFI_NFC_JSON_MAX_LEN) {
        UserDebugOutput_Printf("CH583_PROTO NFC_SET reject json_len=%u max=%u\r\n",
                               (unsigned int)json_len,
                               (unsigned int)CH583_WIFI_NFC_JSON_MAX_LEN);
        return -1;
    }

    encoded_len = ch583_wifi_base64url_encode((const uint8_t *)json,
                                              json_len,
                                              encoded,
                                              sizeof(encoded));
    if (encoded_len <= 0 || encoded_len > CH583_WIFI_MAX_ARG_LEN) {
        UserDebugOutput_Printf("CH583_PROTO NFC_SET encode failed json_len=%u encoded_len=%d max_arg=%u\r\n",
                               (unsigned int)json_len,
                               encoded_len,
                               (unsigned int)CH583_WIFI_MAX_ARG_LEN);
        return -1;
    }

    return ch583_wifi_send_frame("NFC_SET", encoded, 1);
}

int ch583_wifi_uart_send_nfc_clear(void)
{
    return ch583_wifi_send_frame("NFC_CLEAR", "", 1);
}

int ch583_wifi_uart_send_nfc_status(void)
{
    return ch583_wifi_send_frame("NFC_STATUS", "", 1);
}

int ch583_wifi_uart_send_time_get(void)
{
    return ch583_wifi_send_frame("TIME_GET", "", 1);
}

int ch583_wifi_uart_send_time_set(const char *beijing_time)
{
    if (beijing_time == NULL || strlen(beijing_time) != 19U) {
        UserDebugOutput_Printf("CH583_PROTO TIME_SET reject arg=%s\r\n",
                               beijing_time != NULL ? beijing_time : "(null)");
        return -1;
    }
    return ch583_wifi_send_frame("TIME_SET", beijing_time, 1);
}

bool ch583_wifi_uart_test_nfc_step(void)
{
#if CH583_WIFI_NFC_TEST_ENABLE
    static uint8_t step = 0;
    static const char test_json[] =
        "{\"daa\":\"asdasefasdfe\",\"ddfe\":\"elkdj\",\"nfc\":\"lkkdy\",\"iuy\":\"kdkdd\"}";

    switch (step) {
    case 0:
        step++;
        UserDebugOutput_Printf("CH583_PROTO NFC test step=1 NFC_SET\r\n");
        (void)ch583_wifi_uart_send_nfc_set_json(test_json);
        return false;
    case 1:
        step++;
        UserDebugOutput_Printf("CH583_PROTO NFC test step=2 NFC_STATUS\r\n");
        (void)ch583_wifi_uart_send_nfc_status();
        return false;
    case 2:
        step++;
        //UserDebugOutput_Printf("CH583_PROTO NFC test step=3 NFC_CLEAR\r\n");
        //(void)ch583_wifi_uart_send_nfc_clear();
        return false;
    case 3:
        step++;
        UserDebugOutput_Printf("CH583_PROTO NFC test step=4 NFC_STATUS\r\n");
        (void)ch583_wifi_uart_send_nfc_status();
        return true;
    default:
        return true;
    }
#else
    return true;
#endif
}

int ch583_wifi_uart_send_power_off(void)
{    
    return ch583_wifi_send_frame("POWER_OFF", "",1);
}

int ch583_wifi_uart_send_gpio(const char *port, int pin, const char *mode, const char *level)
{
    char arg[32];

