tdxguiping/ESP32_S3_epaper/main/ch583_uart/ch583_wifi_uart_protocol.c
    if (port == NULL || mode == NULL || level == NULL) {
        return -1;
    }

    snprintf(arg, sizeof(arg), "%s,%d,%s,%s", port, pin, mode, level);
    return ch583_wifi_send_frame("GPIO", arg,1);
}

int ch583_wifi_uart_send_gpio_read(const char *port, int pin)
{
    char arg[16];

    if (port == NULL) {
        return -1;
    }

    snprintf(arg, sizeof(arg), "%s,%d", port, pin);
    return ch583_wifi_send_frame("GPIO_READ", arg,1);
}

static bool ch583_wifi_led_name_is_valid(const char *led)
{
    return led != NULL &&
           (strcmp(led, "RED") == 0 || strcmp(led, "GREEN") == 0);
}

int ch583_wifi_uart_send_led_blink(const char *led, uint32_t interval_ms)
{
    char arg[32];

    if (!ch583_wifi_led_name_is_valid(led) || interval_ms < 1U || interval_ms > 10000U) {
        return -1;
    }

    snprintf(arg, sizeof(arg), "%s,%lu", led, (unsigned long)interval_ms);
    return ch583_wifi_send_frame("LED_BLINK", arg, 1);
}

int ch583_wifi_uart_send_led_blink_stop(const char *led)
{
    if (!ch583_wifi_led_name_is_valid(led)) {
        return -1;
    }

    return ch583_wifi_send_frame("LED_BLINK_STOP", led, 1);
}

int ch583_wifi_uart_test_gpio_pa1_high(void)
{    // Send the fixed GPIO test command through the same V1 frame builder used by real protocol replies.
    // 通过 V1 帧构造器发送固定 GPIO 测试命令，避免测试口绕过 CH583 协议输出。
    static uint8_t u8dat=0;

    u8dat++;
    if(u8dat ==1)        return ch583_wifi_uart_send_gpio("PB", 5, "OUT", "HIGH");
    else if(u8dat ==2)            return ch583_wifi_uart_send_gpio("PB", 5, "OUT", "LOW");
    else if(u8dat ==3)            return ch583_wifi_uart_send_gpio("PB", 6, "OUT", "HIGH");
    else if(u8dat ==4)            return ch583_wifi_uart_send_gpio("PB", 6, "OUT", "LOW");
    else  u8dat=0;

    return ch583_wifi_uart_send_gpio("PB", 5, "OUT", "HIGH");
}
